CD2DSizeF.op_Implicit~CSize
Converts CD2DSizeF to CSize object.
Returns:
Current value of D2D size.

CD2DSizeF.IsNull
Returns a Boolean value that indicates whether an expression contains no valid data (Null).
Returns:
TRUE if width and height are empty; otherwise FALSE.

CD2DSizeF.#ctor(System.Single,System.Single)
Constructs a CD2DSizeF object from two FLOAT values.
cx: source width
cy: source height

CD2DSizeF.#ctor(D2D_SIZE_F!System.Runtime.CompilerServices.IsConst*)
Constructs a CD2DSizeF object from D2D1_SIZE_F object.
size: source size

CD2DSizeF.#ctor(D2D_SIZE_F!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DSizeF object from D2D1_SIZE_F object.
size: source size

CD2DSizeF.#ctor(CSize!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructs a CD2DSizeF object from CSize object.
size: source size

CD2DSizeF
D2D1_SIZE_F wrapper